<?php

use yii\helpers\Html;
use common\models\User;
use yii\helpers\Url;
use common\models\Order;
use yii\widgets\ActiveForm;

$this->title = 'Terms of use';
?>

<div class="center">
    <div class="request-head">
        <?= $this->render('@appTheme/layouts/header'); ?>
    </div>
   

    <div class="request-body request-main page-contact">
        <h2>
            <?= Yii::t('app', 'Публічний договір (оферта) від 11.04.2025'); ?>
        </h2>
    <div class="contract">    
	<p><?= Yii::t('app', 'Цей Договір є публічною офертою Товариства з обмеженою відповідальністю "EVERLOGIC LLC" (надалі – "Компанія") для будь-якої фізичної або юридичної особи (надалі – "Користувач") щодо надання послуг за допомогою онлайн-сервісу, розміщеного на веб-сайті blablaprice.com.'); ?></p>


    <h3><?= Yii::t('app', '1. Визначення термінів'); ?></h3>
    <ul>
        <li><?= Yii::t('app', 'Компанія – EVERLOGIC LLC, юридична адреса: Україна, Львівська обл., м. Старий Самбір, вул. Лева Галицького, буд. 48.'); ?></li>
        <li><?= Yii::t('app', 'Веб-сайт – онлайновий сервіс, розміщений за адресою ') . '<a href="https://blablaprice.com">blablaprice.com</a>' . Yii::t('app', ', включаючи всі його піддомени, програмне забезпечення, бази даних та контент.'); ?></li>
        <li><?= Yii::t('app', 'Користувач – будь-яка фізична особа, яка досягла 18-річного віку та має повну цивільну дієздатність, або юридична особа, яка використовує Сервіс після ') . Yii::t('app', 'реєстрації та/або') . Yii::t('app', ' прийняття умов цього Договору ') . Yii::t('app', 'шляхом вчинення конклюдентних дій, що свідчать про таке прийняття (наприклад, початок використання Веб-сайту або його окремих функцій).'); ?></li>
        <li><?= Yii::t('app', 'Послуги – усі послуги, що надаються через Веб-сайт, включаючи, але не обмежуючись, реєстрацією, доступом до особистого кабінету, розміщенням оголошень, запитів, пропозицій, ') . Yii::t('app', 'можливістю обміну контактною інформацією між Користувачами,') . Yii::t('app', ' та іншими функціями сервісу.'); ?></li>
        <li><?= Yii::t('app', 'Обліковий запис – персоналізований розділ Веб-сайту, доступ до якого Користувач отримує після реєстрації та який дозволяє Користувачеві використовувати Послуги.'); ?></li>
        <li><?= Yii::t('app', 'Контент – будь-яка інформація, розміщена на Веб-сайті Компанією або Користувачами, включаючи тексти, зображення, відео, аудіоматеріали, оголошення, контактні дані тощо.'); ?></li>
        <li><?= Yii::t('app', 'Бали – умовні одиниці, що зараховуються на рахунок Користувача (Продавця) після оплати та використовуються для отримання певних Послуг на Веб-сайті, зокрема для оплати комісії за обмін контактною інформацією.') . ' ' . Yii::t('app', 'Бали не є електронними грошима, платіжним засобом чи будь-якою формою валюти та не підлягають поверненню чи обміну на грошові кошти.'); ?></li>
    </ul>


    <h3><?= Yii::t('app', '2. Предмет договору'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '2.1. Компанія надає Користувачеві право користування Веб-сайтом blablaprice.com та Послугами на умовах, визначених цим Договором.') . ' ' . Yii::t('app', 'Компанія виступає виключно як інформаційний посередник, надаючи платформу для взаємодії Користувачів, і не є стороною угод, що можуть укладатися між Користувачами в результаті використання Веб-сайту.'); ?></li>
        <li><?= Yii::t('app', '2.2. ВИКОРИСТАННЯ СЕРВІСУ, ') . Yii::t('app', 'РЕЄСТРАЦІЯ НА ВЕБ-САЙТІ АБО ВЧИНЕННЯ БУДЬ-ЯКИХ ІНШИХ ДІЙ, СПРЯМОВАНИХ НА ВИКОРИСТАННЯ ФУНКЦІОНАЛУ ВЕБ-САЙТУ,') . Yii::t('app', ' ОЗНАЧАЄ ПОВНЕ ТА БЕЗУМОВНЕ ПРИЙНЯТТЯ КОРИСТУВАЧЕМ УМОВ ЦЬОГО ДОГОВОРУ (АКЦЕПТ ОФЕРТИ) ТА ') . Yii::t('app', 'ВСІХ ДОДАТКІВ ДО НЬОГО, ВКЛЮЧАЮЧИ ПОЛІТИКУ КОНФІДЕНЦІЙНОСТІ ТА ПРАВИЛА РОЗМІЩЕННЯ ОГОЛОШЕНЬ. ЯКЩО КОРИСТУВАЧ НЕ ПОГОДЖУЄТЬСЯ З УМОВАМИ ДОГОВОРУ, ВІН НЕ МАЄ ПРАВА ВИКОРИСТОВУВАТИ ВЕБ-САЙТ.'); ?></li>
    </ul>


    <h3><?= Yii::t('app', '3. Надання послуг та оплата'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '3.1. Реєстрація:'); ?>
            <ul>
                <li><?= Yii::t('app', 'Користувач повинен надати точну, актуальну та повну інформацію під час реєстрації ') . Yii::t('app', 'та підтримувати її в такому стані протягом усього періоду користування Сервісом.'); ?></li>
                <li><?= Yii::t('app', 'Користувач несе повну відповідальність за збереження конфіденційності своїх облікових даних (логіна та пароля) ') . Yii::t('app', 'та за всі дії, вчинені під його Обліковим записом.'); ?></li>
                <li><?= Yii::t('app', 'Користувач погоджується негайно повідомити Компанію про будь-яке несанкціоноване використання свого Облікового запису ') . Yii::t('app', 'або будь-яке інше порушення безпеки.'); ?></li>
                <li><?= Yii::t('app', 'Компанія залишає за собою право відмовити в реєстрації, призупинити або видалити Обліковий запис Користувача на свій розсуд, зокрема, якщо надана інформація є неправдивою, неповною, або якщо Користувач порушує умови цього Договору.'); ?></li>
            </ul>
        </li>
        <li><?= Yii::t('app', '3.2. Авторизація: Доступ до особистого кабінету здійснюється шляхом введення логіна (електронної адреси) та пароля.'); ?></li>
        <li><?= Yii::t('app', '3.3. Оплата: Користувач погоджується оплачувати послуги згідно з встановленими тарифами, ') . Yii::t('app', 'опублікованими на Веб-сайті. Компанія має право в односторонньому порядку змінювати тарифи, попередньо повідомивши про це Користувачів шляхом публікації змін на Веб-сайті або надсилання повідомлення на електронну адресу Користувача. Продовження використання Послуг після зміни тарифів означає згоду Користувача з новими тарифами.'); ?></li>
        <li><?= Yii::t('app', '3.4. Поповнення рахунку: Перед відправкою відповіді ') . Yii::t('app', '(якщо це передбачено функціоналом для Продавця)') . Yii::t('app', ' продавець повинен поповнити свій рахунок Балами, з яких буде списана комісія. Купуючи Бали на сервісі, продавець автоматично погоджується з умовами сервісу.'); ?></li>
        <li><?= Yii::t('app', '3.5. Списання Балів: Продавець може безкоштовно відповідати на запити покупців. Однак, при обміні контактною інформацією між покупцем та продавцем ') . Yii::t('app', '(або за інші платні дії, визначені на Веб-сайті)') . Yii::t('app', ', з рахунку продавця списується визначена кількість Балів ') . Yii::t('app', 'згідно з тарифами.'); ?></li>
        <li><?= Yii::t('app', '3.6. Політика відсутності повернення коштів:'); ?>
            <ul>
                <li><?= Yii::t('app', 'Придбані на сервісі Бали ') . Yii::t('app', 'та/або кошти, сплачені за Послуги,') . Yii::t('app', ' не підлягають поверненню за будь-яких обставин, включаючи, але не обмежуючись:'); ?>
                    <ul>
                        <li><?= Yii::t('app', 'Видалення Облікового запису (як Користувачем, так і Компанією);'); ?></li>
                        <li><?= Yii::t('app', 'Припинення надання Послуг Компанією;'); ?></li>
                        <li><?= Yii::t('app', 'Зміна рішення Користувачем;'); ?></li>
                        <li><?= Yii::t('app', 'Випадкові покупки;'); ?></li>
                        <li><?= Yii::t('app', 'Невикористання Балів Користувачем;'); ?></li>
                        <li><?= Yii::t('app', 'Блокування Облікового запису Користувача через порушення умов Договору.'); ?></li>
                    </ul>
                </li>
                <li><?= Yii::t('app', 'Компанія може на свій власний розсуд, без будь-яких зобов\'язань, розглянути можливість повернення коштів або Балів у виняткових випадках, однак таке рішення не створює прецеденту для майбутніх звернень.'); ?></li>
            </ul>
        </li>
        <li><?= Yii::t('app', '3.7. Процедура обміну: Після розміщення пропозиції продавця, покупець відповідає, надаючи свою контактну інформацію. Система автоматично фіксує факт обміну контактною інформацією та ініціює списання відповідної комісії (у Балах) з рахунку продавця.'); ?></li>
        <li><?= Yii::t('app', '3.8. Підтвердження: Публікація пропозиції продавця ') . Yii::t('app', 'та/або будь-яка дія, що призводить до ініціювання обміну контактами,') . Yii::t('app', ' вважається підтвердженням його згоди на оплату комісії за обмін контактами, незалежно від подальшого укладення угоди ') . Yii::t('app', 'чи фактичної взаємодії між Користувачами.'); ?></li>
        <li><?= Yii::t('app', '3.9. Оплата: Оплата за обмін контактами здійснюється автоматично шляхом списання Балів з рахунку Продавця ') . Yii::t('app', 'через інтегровану систему Веб-сайту,') . Yii::t('app', ' без можливості скасування транзакції після надання покупцем контактної інформації ') . Yii::t('app', 'або іншої дії, що тарифікується.'); ?></li>
			</ul>


    <h3><?= Yii::t('app', '4. Відмова від відповідальності'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '4.1. Обмеження сервісу:'); ?>
            <ul>
                <li><?= Yii::t('app', 'Сервіс надається «як є» ') . Yii::t('app', 'та «як доступно»') . Yii::t('app', ', без будь-яких прямих або непрямих гарантій, включаючи, але не обмежуючись, гарантіями придатності для конкретної мети, точності, безперебійної роботи, своєчасності, безпеки, ') . Yii::t('app', 'відсутності вірусів чи інших шкідливих компонентів.'); ?></li>
                <li><?= Yii::t('app', 'Компанія не гарантує відсутність технічних збоїв або помилок. Будь-які технічні несправності є типовими для складних інформаційних систем, і Компанія не несе за них відповідальності.') . ' ' . Yii::t('app', 'Компанія докладатиме розумних зусиль для відновлення працездатності Сервісу у найкоротші можливі строки, але не гарантує жодних конкретних термінів.'); ?></li>
                <li><?= Yii::t('app', 'Компанія не несе відповідальності за зміст Контенту, розміщеного Користувачами, та за будь-які угоди, укладені між Користувачами. Всі взаємодії та угоди між Користувачами здійснюються на їх власний ризик.'); ?></li>
                <li><?= Yii::t('app', 'Компанія не перевіряє достовірність інформації, що надається Користувачами, та не гарантує добросовісність Користувачів.'); ?></li>
            </ul>
        </li>
        <li><?= Yii::t('app', '4.2. Обмеження відповідальності:'); ?>
            <ul>
                <li><?= Yii::t('app', 'У МАКСИМАЛЬНО ДОЗВОЛЕНІЙ ЗАКОНОДАВСТВОМ МІРІ,') . Yii::t('app', ' ЗАГАЛЬНА ВІДПОВІДАЛЬНІСТЬ КОМПАНІЇ ПЕРЕД КОРИСТУВАЧЕМ ЗА ВСІМА ПРЕТЕНЗІЯМИ, ЩО ВИНИКАЮТЬ З АБО У ЗВ’ЯЗКУ З ЦИМ ДОГОВОРОМ ') . Yii::t('app', 'АБО ВИКОРИСТАННЯМ СЕРВІСУ') . Yii::t('app', ', НЕ ПОВИННА ПЕРЕВИЩУВАТИ ЗАГАЛЬНУ СУМУ, СПЛАЧЕНУ КОРИСТУВАЧЕМ КОМПАНІЇ ЗА ПОСЛУГИ ЗА ПОПЕРЕДНІ ') . Yii::t('app', '3 (ТРИ)') . Yii::t('app', ' МІСЯЦІ, ЩО ПЕРЕДУВАЛИ ДАТІ ВИНИКНЕННЯ ПІДСТАВ ДЛЯ ПРЕТЕНЗІЇ.') . ' ' . Yii::t('app', 'ЯКЩО КОРИСТУВАЧ НЕ СПЛАЧУВАВ ЖОДНИХ СУМ КОМПАНІЇ ПРОТЯГОМ ЦЬОГО ПЕРІОДУ, ВІДПОВІДАЛЬНІСТЬ КОМПАНІЇ ОБМЕЖУЄТЬСЯ МІНІМАЛЬНО МОЖЛИВОЮ СУМОЮ, ВСТАНОВЛЕНОЮ ЗАКОНОДАВСТВОМ, АБО СУМОЮ В 100 (СТО) ГРИВЕНЬ, ЗАЛЕЖНО ВІД ТОГО, ЯКА СУМА Є БІЛЬШОЮ.'); ?></li>
            </ul>
        </li>
        <li><?= Yii::t('app', '4.3. Винятки: Компанія не несе відповідальності за:'); ?>
            <ul>
                <li><?= Yii::t('app', 'Будь-які переривання або помилки в роботі сервісу, ') . Yii::t('app', 'включаючи тимчасову недоступність Веб-сайту або його окремих функцій.'); ?></li>
                <li><?= Yii::t('app', 'Втрату даних, ') . Yii::t('app', 'втрату прибутку, упущену вигоду, шкоду діловій репутації, непрямі, випадкові, побічні або штрафні збитки,') . Yii::t('app', ' незалежно від того, чи могла Компанія передбачити такі збитки.'); ?></li>
                <li><?= Yii::t('app', 'Будь-які збитки, що виникли внаслідок:'); ?>
                    <ul>
                        <li><?= Yii::t('app', 'Обставин непереборної сили (форс-мажор);'); ?></li>
                        <li><?= Yii::t('app', 'Дій ') . Yii::t('app', 'або бездіяльності') . Yii::t('app', ' третіх осіб, ') . Yii::t('app', 'включаючи інших Користувачів;'); ?></li>
                        <li><?= Yii::t('app', 'Невиконання Користувачем вимог безпеки ') . Yii::t('app', 'та умов цього Договору;'); ?></li>
                        <li><?= Yii::t('app', 'Несанкціонованого доступу до Облікового запису Користувача ') . Yii::t('app', 'та/або персональних даних Користувача;'); ?></li>
                        <li><?= Yii::t('app', 'Дій шкідливого програмного забезпечення (вірусів, троянів тощо);'); ?></li>
                        <li><?= Yii::t('app', 'Будь-яких угод або взаємодій між Користувачами.'); ?></li>
                    </ul>
                </li>
            </ul>
        </li>
        <li><?= Yii::t('app', '4.4. Прийняття ризиків: Користувач ') . Yii::t('app', 'визнає та погоджується, що') . Yii::t('app', ' використовує сервіс на власний ризик і погоджується звільнити Компанію ') . Yii::t('app', 'та її афілійованих осіб, посадових осіб, директорів, співробітників та агентів') . Yii::t('app', ' від будь-якої відповідальності, ') . Yii::t('app', 'претензій, збитків, витрат (включаючи розумні витрати на юридичну допомогу),') . Yii::t('app', ' що можуть виникнути у зв’язку з використанням Сервісу Користувачем ') . Yii::t('app', 'або порушенням ним цього Договору.'); ?></li>
    </ul>


    <h3><?= Yii::t('app', '5. Обов’язки та гарантії Користувача'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '5.1. Гарантії: Користувач гарантує, що:'); ?>
            <ul>
                <li><?= Yii::t('app', 'Має повну юридичну дієздатність для укладення цього Договору.'); ?></li>
                <li><?= Yii::t('app', 'Вся надана ним інформація є правдивою, точною, актуальною та повною.'); ?></li>
                <li><?= Yii::t('app', 'Не буде використовувати сервіс у незаконних цілях, ') . Yii::t('app', 'а також у цілях, що суперечать моральним засадам суспільства, або порушують права третіх осіб.'); ?></li>
                <li><?= Yii::t('app', 'Його дії на Веб-сайті не порушуватимуть чинне законодавство України та права інтелектуальної власності третіх осіб.'); ?></li>
                <li><?= Yii::t('app', 'Він є законним власником товарів/послуг, які він пропонує, або має всі необхідні дозволи та ліцензії для їх пропонування/продажу.'); ?></li>
            </ul>
        </li>
        <li><?= Yii::t('app', '5.2. Заборонені дії: Суворо забороняються наступні дії:'); ?>
            <ul>
                <li><?= Yii::t('app', 'Спроби отримати несанкціонований доступ до системи, ') . Yii::t('app', 'Облікових записів інших Користувачів, комп\'ютерних систем або мереж, пов\'язаних з Веб-сайтом, шляхом злому, підбору паролів або будь-якими іншими засобами.'); ?></li>
                <li><?= Yii::t('app', 'Порушення нормальної роботи сервісу, ') . Yii::t('app', 'включаючи використання будь-яких пристроїв, програмного забезпечення або процедур, що можуть заважати належному функціонуванню Веб-сайту.'); ?></li>
                <li><?= Yii::t('app', 'Збір або зберігання персональних даних інших користувачів ') . Yii::t('app', 'без їхньої згоди та всупереч Політиці конфіденційності.'); ?></li>
                <li><?= Yii::t('app', 'Створення кількох Облікових записів з шахрайською метою ') . Yii::t('app', 'або для обходу обмежень, встановлених Компанією.'); ?></li>
                <li><?= Yii::t('app', 'Розміщення Контенту, який є незаконним, шкідливим, загрозливим, образливим, наклепницьким, дискримінаційним, порнографічним, таким, що розпалює міжнаціональну чи релігійну ворожнечу, або порушує права третіх осіб.'); ?></li>
                <li><?= Yii::t('app', 'Використання Веб-сайту для розсилки спаму, небажаної реклами або будь-яких інших форм масових розсилок.'); ?></li>
                <li><?= Yii::t('app', 'Видавати себе за іншу особу або організацію, або надавати неправдиву інформацію про свій зв\'язок з будь-якою особою чи організацією.'); ?></li>
                <li><?= Yii::t('app', 'Здійснювати будь-які дії, що можуть призвести до надмірного або непропорційно великого навантаження на інфраструктуру Веб-сайту.'); ?></li>
                <li><?= Yii::t('app', 'Декомпілювати, здійснювати зворотне проектування, розбирати або іншим чином намагатися отримати вихідний код програмного забезпечення Веб-сайту.'); ?></li>
                <li><?= Yii::t('app', 'Використовувати будь-які автоматизовані засоби (скрипти, боти, роботи) для доступу до Веб-сайту або збору інформації без попереднього письмового дозволу Компанії.'); ?></li>
            </ul>
        </li>
    </ul>


    <h3><?= Yii::t('app', '6. Інтелектуальна власність'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '6.1. Право власності:'); ?>
            <ul>
                <li><?= Yii::t('app', 'Усі ') . Yii::t('app', 'права на') . Yii::t('app', ' матеріали, тексти, зображення, логотипи, ') . Yii::t('app', 'дизайн, програмний код, бази даних') . Yii::t('app', ' та інші елементи сервісу (надалі – "Об\'єкти інтелектуальної власності Компанії") є інтелектуальною власністю Компанії або її ліцензіарів і охороняються законом.'); ?></li>
                <li><?= Yii::t('app', 'Використання Об\'єктів інтелектуальної власності Компанії без ') . Yii::t('app', 'попередньої письмової') . Yii::t('app', ' згоди Компанії суворо заборонено.'); ?></li>
            </ul>
        </li>
        <li><?= Yii::t('app', '6.2. Ліцензія Користувачеві: Користувач отримує обмежену, невиключну, непередавану, ') . Yii::t('app', 'відкличну') . Yii::t('app', ' ліцензію на використання сервісу ') . Yii::t('app', 'виключно для особистих некомерційних цілей (якщо Користувач є Покупцем) або для цілей ведення бізнесу в рамках функціоналу, наданого Продавцям,') . Yii::t('app', ' відповідно до умов цього Договору.') . ' ' . Yii::t('app', 'Ця ліцензія не надає Користувачеві жодних прав власності на Об\'єкти інтелектуальної власності Компанії.'); ?></li>
        <li><?= Yii::t('app', '6.3. Зарезервовані права: Усі права, прямо не надані цим Договором, зарезервовані Компанією.'); ?></li>
        <li><?= Yii::t('app', '6.4. Контент Користувача:'); ?>
            <ul>
                <li><?= Yii::t('app', 'Користувач зберігає всі права інтелектуальної власності на Контент, який він розміщує на Веб-сайті (наприклад, тексти оголошень, фотографії товарів).'); ?></li>
                <li><?= Yii::t('app', 'Розміщуючи Контент на Веб-сайті, Користувач надає Компанії безоплатну, невиключну, всесвітню, безстрокову, передавану ліцензію (з правом субліцензування) на використання, копіювання, відтворення, модифікацію, адаптацію, публікацію, переклад, розповсюдження, публічне виконання та демонстрацію такого Контенту (повністю або частково) у зв\'язку з наданням Послуг та функціонуванням Веб-сайту, а також для маркетингових та рекламних цілей Компанії.'); ?></li>
                <li><?= Yii::t('app', 'Користувач гарантує, що він має всі необхідні права та дозволи для розміщення Контенту на Веб-сайті та для надання Компанії вищевказаної ліцензії, і що такий Контент не порушує прав третіх осіб (включаючи права інтелектуальної власності, права на недоторканність приватного життя тощо) та чинне законодавство.'); ?></li>
            </ul>
        </li>
    </ul>


    <h3><?= Yii::t('app', '7. Розірвання договору'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '7.1. Компанія може розірвати цей Договір та/або призупинити ') . Yii::t('app', 'чи обмежити') . Yii::t('app', ' доступ Користувача до Сервісу ') . Yii::t('app', 'повністю або частково') . Yii::t('app', ' негайно, без попереднього повідомлення ') . Yii::t('app', 'та без виплати будь-якої компенсації,') . Yii::t('app', ' у випадку:'); ?>
            <ul>
                <li><?= Yii::t('app', 'Порушення Користувачем ') . Yii::t('app', 'будь-яких') . Yii::t('app', ' умов цього Договору ') . Yii::t('app', 'або документів, що є його невід\'ємною частиною.'); ?></li>
                <li><?= Yii::t('app', 'Підозри у шахрайській діяльності ') . Yii::t('app', 'або будь-яких інших протиправних діях.'); ?></li>
                <li><?= Yii::t('app', 'Незаконного використання сервісу.'); ?></li>
                <li><?= Yii::t('app', 'Повторних скарг від інших користувачів ') . Yii::t('app', 'на дії або Контент Користувача.'); ?></li>
                <li><?= Yii::t('app', 'Надання Користувачем неправдивої, неточної або неповної інформації.'); ?></li>
                <li><?= Yii::t('app', 'Якщо дії Користувача можуть завдати шкоди Компанії, іншим Користувачам або третім особам, або створити загрозу безпеці Веб-сайту.'); ?></li>
                <li><?= Yii::t('app', 'За рішенням суду або іншого уповноваженого державного органу.'); ?></li>
                <li><?= Yii::t('app', 'У разі припинення діяльності Компанії або припинення надання Послуг.'); ?></li>
            </ul>
        </li>
        <li><?= Yii::t('app', '7.2. Користувач може розірвати цей Договір у будь-який час, видаливши свій Обліковий запис або припинивши використання Веб-сайту. При цьому кошти та Бали, сплачені Користувачем, не повертаються.'); ?></li>
        <li><?= Yii::t('app', '7.3. У разі розірвання Договору з будь-яких причин, положення, які за своєю природою повинні залишатися чинними після розірвання (включаючи, але не обмежуючись, положення про інтелектуальну власність, відмову від відповідальності, обмеження відповідальності, відшкодування збитків, вирішення спорів, застосовне право), залишаються чинними.'); ?></li>
        <li><?= Yii::t('app', '7.4. Компанія не несе відповідальності перед Користувачем або будь-якою третьою стороною за будь-яке припинення або призупинення доступу Користувача до Сервісу.'); ?></li>
    </ul>


    <h3><?= Yii::t('app', '8. Вирішення спорів'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '8.1. Усі спори ') . Yii::t('app', 'та розбіжності, що виникають з цього Договору або у зв\'язку з ним,') . Yii::t('app', ' повинні спочатку намагатися бути вирішеними шляхом переговорів ') . Yii::t('app', 'між Сторонами. Сторона, яка вважає свої права порушеними, надсилає іншій Стороні письмову претензію електронною поштою. Строк розгляду претензії – 30 (тридцять) календарних днів з моменту її отримання.'); ?></li>
        <li><?= Yii::t('app', '8.2. У разі неможливості вирішення спору шляхом переговорів, спір підлягає вирішенню ') . Yii::t('app', 'в судовому порядку') . Yii::t('app', ' відповідно до законодавства України.'); ?></li>
        <li><?= Yii::t('app', '8.3. Суди за місцезнаходженням Компанії мають виключну юрисдикцію ') . Yii::t('app', 'щодо будь-яких спорів, що виникають з цього Договору або у зв\'язку з ним.'); ?></li>
    </ul>


    <h3><?= Yii::t('app', '9. Строк позовної давності'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '9.1. Будь-які претензії ') . Yii::t('app', 'Користувача') . Yii::t('app', ' до Компанії, що виникають з цього Договору або у зв\'язку з ним, повинні бути подані протягом ') . Yii::t('app', '6 (шести)') . Yii::t('app', ' місяців з дати виникнення підстав для претензії.') . ' ' . Yii::t('app', 'Після закінчення цього строку будь-які претензії вважаються такими, що втратили силу.'); ?></li>
    </ul>


    <h3><?= Yii::t('app', '10. Форс-мажор'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '10.1. Жодна зі сторін не несе відповідальності за повне або часткове невиконання своїх зобов’язань за цим Договором, якщо таке невиконання є наслідком обставин непереборної сили (форс-мажору), що виникли після укладення Договору та які Сторона не могла ані передбачити, ані запобігти розумними заходами. До таких обставин належать, зокрема, але не обмежуючись:'); ?>
            <ul>
                <li><?= Yii::t('app', 'Стихійні лиха (землетруси, повені, урагани тощо);'); ?></li>
                <li><?= Yii::t('app', 'Дії уряду, ') . Yii::t('app', 'законодавчі акти, що унеможливлюють виконання зобов\'язань;'); ?></li>
                <li><?= Yii::t('app', 'Військові дії, терористичні акти, громадські заворушення, епідемії, пандемії;'); ?></li>
                <li><?= Yii::t('app', 'Перебої в роботі Інтернету ') . Yii::t('app', 'на магістральному рівні, масштабні DDoS-атаки, збої в електропостачанні, що не залежать від волі Сторін;'); ?></li>
                <li><?= Yii::t('app', 'Кібернетичні атаки, ') . Yii::t('app', 'що не могли бути попереджені за допомогою розумних заходів безпеки.'); ?></li>
            </ul>
        </li>
        <li><?= Yii::t('app', '10.2. Сторона, для якої настали форс-мажорні обставини, повинна протягом 5 (п\'яти) календарних днів повідомити іншу Сторону про їх настання та припинення. Неповідомлення або несвоєчасне повідомлення позбавляє Сторону права посилатися на такі обставини як на підставу звільнення від відповідальності.'); ?></li>
        <li><?= Yii::t('app', '10.3. Якщо форс-мажорні обставини тривають понад 3 (три) місяці, кожна зі Сторін має право розірвати Договір в односторонньому порядку, повідомивши про це іншу Сторону.'); ?></li>
    </ul>


    <h3><?= Yii::t('app', '11. Чинність окремих положень (Автономність положень)'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '11.1. Якщо будь-яке положення цього Договору буде визнано недійсним, незаконним або таким, що не підлягає виконанню, будь-яким судом або компетентним органом, таке положення вважатиметься вилученим з Договору, а інші положення залишаються в повній силі та дії ') . Yii::t('app', 'і тлумачитимуться таким чином, щоб максимально відобразити початкові наміри Сторін.'); ?></li>
    </ul>


    <h3><?= Yii::t('app', '12. Повний обсяг договору (Вичерпний характер Договору)'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '12.1. Цей Договір, ') . Yii::t('app', 'включаючи всі додатки та документи, на які він посилається (зокрема, Політику конфіденційності та Правила розміщення оголошень),') . Yii::t('app', ' становить повну домовленість між Сторонами щодо предмету Договору та замінює всі попередні усні та письмові домовленості, заяви та гарантії між Сторонами щодо такого предмету.'); ?></li>
    </ul>


    <h3><?= Yii::t('app', '13. Застосовне право'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '13.1. Цей Договір регулюється та тлумачиться відповідно до законодавства України.'); ?></li>
    </ul>


    <h3><?= Yii::t('app', '14. Додаткові умови'); ?></h3>
    <ul>
        <li><?= Yii::t('app', '14.1. Політика конфіденційності та Правила розміщення оголошень є невід’ємними частинами цього Договору ') . Yii::t('app', 'і доступні для ознайомлення на Веб-сайті.'); ?></li>
        <li><?= Yii::t('app', '14.2. Користувач підтверджує, що ознайомився, зрозумів та ') . Yii::t('app', 'повністю погоджується з умовами') . Yii::t('app', ' усіх пов’язаних документів.'); ?></li>
        <li><?= Yii::t('app', '14.3. Компанія має право в будь-який час в односторонньому порядку вносити зміни та доповнення до цього Договору та його невід\'ємних частин. Такі зміни набирають чинності з моменту їх публікації на Веб-сайті, якщо інший строк набрання чинності не визначений додатково при їх публікації. Користувач зобов\'язаний самостійно регулярно перевіряти наявність змін до Договору. Продовження використання Веб-сайту Користувачем після внесення змін та/або доповнень до Договору означає повну та беззастережну згоду Користувача з такими змінами та/або доповненнями.'); ?></li>
        <li><?= Yii::t('app', '14.4. Компанія має право передавати свої права та обов\'язки за цим Договором третім особам без згоди Користувача. Користувач не має права передавати свої права та обов\'язки за цим Договором третім особам без попередньої письмової згоди Компанії.'); ?></li>
        <li><?= Yii::t('app', '14.5. Жодні положення цього Договору не створюють між Компанією та Користувачем відносин агентства, партнерства, спільної діяльності, трудових відносин або будь-яких інших відносин, прямо не передбачених цим Договором.'); ?></li>
        <li><?= Yii::t('app', '14.6. Бездіяльність з боку Компанії у разі порушення Користувачем або іншими користувачами положень Договору не позбавляє Компанію права вживати відповідних заходів на захист своїх інтересів пізніше, а також не означає відмови Компанії від своїх прав у разі вчинення в подальшому подібних або схожих порушень.'); ?></li>
        <li><?= Yii::t('app', '14.7. Заголовки розділів у цьому Договорі використовуються лише для зручності та не впливають на тлумачення положень Договору.'); ?></li>
    </ul>



    <h3><?= Yii::t('app', 'Правила розміщення оголошень та категорії заборонених товарів'); ?></h3>
    <h4><?= Yii::t('app', 'Категорії заборонених товарів ') . Yii::t('app', 'та послуг') . Yii::t('app', ':'); ?></h4>
    <ul>
        <li><?= Yii::t('app', 'Наркотичні засоби, психотропні речовини, ') . Yii::t('app', 'їх аналоги та прекурсори, а також рослини, що їх містять.'); ?></li>
        <li><?= Yii::t('app', 'Вогнепальна ') . Yii::t('app', 'та холодна') . Yii::t('app', ' зброя, боєприпаси, ') . Yii::t('app', 'вибухові речовини та пристрої,') . Yii::t('app', ' комплектуючі ') . Yii::t('app', 'до них, а також спеціальні засоби самооборони.'); ?></li>
        <li><?= Yii::t('app', 'Контрафактна продукція, піратські копії, підробки, ') . Yii::t('app', 'товари, що порушують права інтелектуальної власності третіх осіб (наприклад, неліцензійне програмне забезпечення, копії брендів).'); ?></li>
        <li><?= Yii::t('app', 'Людські органи та останки, біологічні матеріали.'); ?></li>
        <li><?= Yii::t('app', 'Продукція, що пропагує насильство, ненависть, дискримінацію ') . Yii::t('app', 'за будь-якою ознакою (расовою, релігійною, гендерною тощо), жорстоке поводження з тваринами.'); ?></li>
        <li><?= Yii::t('app', 'Послуги сексуального характеру, порнографічні матеріали.'); ?></li>
        <li><?= Yii::t('app', 'Товари, отримані злочинним шляхом.'); ?></li>
        <li><?= Yii::t('app', 'Фінансові піраміди, схеми швидкого збагачення, послуги з "обгону" лічильників тощо.'); ?></li>
        <li><?= Yii::t('app', 'Медичні препарати, що відпускаються за рецептом, лікарські засоби, що не зареєстровані в Україні, біологічно активні добавки без належної сертифікації.'); ?></li>
        <li><?= Yii::t('app', 'Тютюнові вироби та алкогольні напої (крім колекційних).'); ?></li>
        <li><?= Yii::t('app', 'Інші товари ') . Yii::t('app', 'та послуги') . Yii::t('app', ', продаж, реклама або обіг яких заборонені чи обмежені чинним законодавством України.'); ?></li>
        <li><?= Yii::t('app', 'Будь-який контент, що містить шкідливе програмне забезпечення, віруси, фішингові посилання.'); ?></li>
    </ul>
    <h4><?= Yii::t('app', 'Застосування:'); ?></h4>
    <ul>
        <li><?= Yii::t('app', 'Компанія залишає за собою право ') . Yii::t('app', 'на власний розсуд та') . Yii::t('app', ' без попереднього повідомлення ') . Yii::t('app', 'та пояснення причин') . Yii::t('app', ' видаляти будь-який Контент ') . Yii::t('app', 'або блокувати доступ до нього,') . Yii::t('app', ' що порушує цей Договір, Правила розміщення оголошень або чинне законодавство України, а також у випадку отримання відповідних скарг від третіх осіб або вимог уповноважених державних органів.'); ?></li>
        <li><?= Yii::t('app', 'Користувач несе повну ') . Yii::t('app', 'та виключну') . Yii::t('app', ' відповідальність за дотримання цих правил ') . Yii::t('app', 'та за весь Контент, який він розміщує на Веб-сайті.'); ?></li>
        <li><?= Yii::t('app', 'Повторні ') . Yii::t('app', 'або грубі') . Yii::t('app', ' порушення можуть призвести до ') . Yii::t('app', 'тимчасового або') . Yii::t('app', ' постійного блокування Облікового запису ') . Yii::t('app', 'без права на відновлення та без повернення сплачених коштів чи Балів.'); ?></li>
        <li><?= Yii::t('app', 'Компанія має право, але не зобов\'язана, здійснювати модерацію Контенту, розміщеного Користувачами.'); ?></li>
    </ul>
    <h4><?= Yii::t('app', 'Комунікація'); ?></h4>
    <ul>
        <li><?= Yii::t('app', 'Уся кореспонденція ') . Yii::t('app', 'та офіційні повідомлення') . Yii::t('app', ' між сторонами здійснюється через електронну адресу, вказану ') . Yii::t('app', 'Користувачем') . Yii::t('app', ' при реєстрації, ') . Yii::t('app', 'та офіційні електронні адреси Компанії, вказані на Веб-сайті.') . ' ' . Yii::t('app', 'Користувач зобов\'язаний підтримувати актуальність своєї контактної інформації.'); ?></li>
        <li><?= Yii::t('app', 'Електронні повідомлення, ') . Yii::t('app', 'надіслані з використанням зазначених електронних адрес,') . Yii::t('app', ' вважаються еквівалентними письмовим повідомленням, ') . Yii::t('app', 'підписаним власноруч, та мають повну юридичну силу.'); ?></li>
        <li><?= Yii::t('app', 'Користувач дає згоду на отримання юридично значущих повідомлень, ') . Yii::t('app', 'а також інформаційних та рекламних розсилок від Компанії') . Yii::t('app', ' в електронній формі ') . Yii::t('app', 'на вказану ним електронну адресу та/або через інші канали зв\'язку, зазначені в Обліковому записі. Користувач може відмовитися від отримання рекламних розсилок, дотримуючись інструкцій, наданих у таких розсилках.'); ?></li>
    </ul>


    </div>
    <div class="empty-space-40"></div>
</div>
<div class="popup-wrapper">
    <div class="close-layer"></div>

    <?= $this->render('@appTheme/popup/popup-account-login') ?>
    <?= $this->render('@appTheme/popup/popup-account-registration') ?>
    <?= $this->render('@appTheme/popup/popup-account-reset-password') ?>
	<?= $this->render('@appTheme/popup/language'); ?>
</div>
